Repository: zipf/perldoc-es
Catalog: _reference/legacy_materials/omegat_memory/project_save.tmx
Source language: en_us
Languages: es_es

source: Returns the cosine of EXPR (expressed in radians).
es_es: Devuelve el coseno de EXPR (expresado en radianes).

source: If EXPR is omitted, takes cosine of C<$_>.
es_es: Si EXPR se omite, devuelve el coseno de C<$_>.

source: For the inverse cosine operation, you may use the C<Math::Trig::acos()> function, or use this relation:
es_es: Para la inversa de la operación coseno, puede usar la función C<Math::Trig::acos()>, o usar esta relación:

source: =item crypt PLAINTEXT,SALT X<crypt> X<digest> X<hash> X<salt> X<plaintext> X<password> X<decrypt> X<cryptography> X<passwd>
es_es: =item crypt TEXTOPLANO,SALTO X<crypt> X<digest> X<hash> X<salt> X<plaintext> X<password> X<decrypt> X<cryptography> X<passwd> X<contraseña>

source: Creates a digest string exactly like the crypt(3) function in the C library (assuming that you actually have a version there that has not been extirpated as a potential munitions).
es_es: Crea un string resumen exáctamente igual que la función crypt(3) de la biblioteca C (asumiendo que realmente tenga una versión de la que no haya sido exterpida por ser considerada un arma).

source: crypt() is a one-way hash function.
es_es: crypt() es una función hash de un sólo sentido.

source: The PLAINTEXT and SALT is turned into a short string, called a digest, which is returned.
es_es: El TEXTOPLANO y el SALTO se convierten en un pequeño string, llamado I<digest> (compendio, resumen), que es devuelto.

source: The same PLAINTEXT and SALT will always return the same string, but there is no (known) way to get the original PLAINTEXT from the hash.
es_es: Los mismos TEXTOPLANO y SALTO siempre devolverán el mismo string, pero no hay una forma (conocida) de obtener el TEXTOPLANO original desde el hash.

source: Small changes in the PLAINTEXT or SALT will result in large changes in the digest.
es_es: Pequeños cambios en TEXTPLANO o SALTO resultarán en grandes cambios en el I<digest>.

source: There is no decrypt function.
es_es: No existe la función decrypt.

source: This function isn't all that useful for cryptography (for that, look for F<Crypt> modules on your nearby CPAN mirror) and the name "crypt" is a bit of a misnomer.
es_es: Esta función no es muy útil para criptografía (para esto, mire en los módulos F<Crypt> en su espejo CPAN más cercano) y el nombre "crypt" es un poco equívoco.

source: Instead it is primarily used to check if two pieces of text are the same without having to transmit or store the text itself.
es_es: En cambio se usa principalmente para comprobar si dos trozos de textos son el mismo sin tener que transmitirlo o almacenarlo.

source: An example is checking if a correct password is given.
es_es: Un ejemplo es comprobando si se ha dado una contraseña correcta.

source: The digest of the password is stored, not the password itself.
es_es: El I<digest> de una contraseña se almacena, no la propia contraseña.

source: The user types in a password that is crypt()'d with the same salt as the stored digest.
es_es: El usuario escribe la contraseña que es en-crypt()-tada con el mismo salto con el que fue almacenado el I<digest>.

source: If the two digests match the password is correct.
es_es: Si los dos I<digest> coinciden, la contraseña es correcta.

source: When verifying an existing digest string you should use the digest as the salt (like C<crypt($plain, $digest) eq $digest>).
es_es: Cuando verifique un string i<digest> debe usar el propio I<digest> como el salto (como C<crypt($plano, $digest) eq $digest>).

source: The SALT used to create the digest is visible as part of the digest.
es_es: El SALTO usado para crear el I<digest> es visible como parte del I<digest>.

source: This ensures crypt() will hash the new string with the same salt as the digest.
es_es: Esto asegura que crypt() hará el hash del nuevo string con el mismo salto que el I<digest>.

source: This allows your code to work with the standard L<crypt|/crypt> and with more exotic implementations.
es_es: Esto permite a su código trabajar con el estándar L<crypt|/crypt> y con implementaciones más exóticas.

source: In other words, do not assume anything about the returned string itself, or how many bytes in the digest matter.
es_es: En otras palabras, no asuma nada sobre el string devuelto, o que cuántos bytes ocupa el I<digest>.

source: Traditionally the result is a string of 13 bytes: two first bytes of the salt, followed by 11 bytes from the set C<[./0-9A-Za-z]>, and only the first eight bytes of the digest string mattered, but alternative hashing schemes (like MD5), higher level security schemes (like C2), and implementations on non-UNIX platforms may produce different strings.
es_es: Tradicionalmente el resultado es un string de 13 bytes: los dos primeros bytes son el salto, seguido de 11 bytes del conjunto C<[./0-9A-Za-z]>, y sólo los primeros ocho bytes del I<digest> interesan, pero esquemas alternativos de cálculo de hash (como MD5), esquemas de seguridad de alto nivel (como C2) e implementacionesen plataformas no UNIX pueden producir strings diferentes.

source: When choosing a new salt create a random two character string whose characters come from the set C<[./0-9A-Za-z]> (like C<join '', ('.', '/', 0..9, 'A'..'Z', 'a'..'z')[rand 64, rand 64]>).
es_es: Cuando escoja un nuevo salto cree un string de dos caracteres elegidos aleatoriamente del conjunto C<[./0-9A-Za-z]> (como por ejemplo C<join '', ('.', '/', 0..9, 'A'..'Z', 'a'..'z')[rand 64, rand 64]>).

source: This set of characters is just a recommendation; the characters allowed in the salt depend solely on your system's crypt library, and Perl can't restrict what salts C<crypt()> accepts.
es_es: Este conjunto de caracteres es sólo una recomendación; los caracteres permitidos en el salto dependen solamente de la función crypt del sistema y Perl no puede restringir el salto que C<crypt()> acepte.

source: Here's an example that makes sure that whoever runs this program knows their password:
es_es: Aquí hay un ejemplo que se asegura que quien corra el programa conoce su contraseña:

source: chomp($word = <STDIN>);
es_es: chomp($palabra = <STDIN>);

# if (crypt($word, $pwd) ne $pwd) { die "Sorry... ";
source: if (crypt($word, $pwd) ne $pwd) { die "Sorry...\n";
es_es: if (crypt($palabra, $pwd) ne $pwd) { die "Lo siento...\n";

# } else { print "ok ";
source: } else { print "ok\n";
es_es: } else { print "correcto\n";

source: Of course, typing in your own password to whoever asks you for it is unwise.
es_es: Naturalmente es muy imprudente dar la propia contraseña a cualquiera que lo pregunte.

source: The L<crypt|/crypt> function is unsuitable for hashing large quantities of data, not least of all because you can't get the information back.
es_es: La función L<crypt|/crypt> no es apropiada para calcular el hash de grandes volúmenes de información, teniendo en cuenta que no es posible luego volver a obtener la misma información.

source: Look at the L<Digest> module for more robust algorithms.
es_es: Mire en el módulo L<Digest> por algoritmos más robustos.

source: If using crypt() on a Unicode string (which I<potentially> has characters with codepoints above 255), Perl tries to make sense of the situation by trying to downgrade (a copy of the string) the string back to an eight-bit byte string before calling crypt() (on that copy).
es_es: Si usa crypt() en un string Unicode (que I<potencialmente> tiene caracteres con codificación superior al 255), Perl intenta hacer sentido a la situación intentando hacer una degradación (una copia del string) a un string de bytes antes de llamar a crypt() (sobre esa copia).

source: If that works, good.
es_es: Si esto funciona, bien.

source: If not, crypt() dies with C<Wide character in crypt>.
es_es: Si no, crypt() muere con C<Wide character in crypt>.

source: [This function has been largely superseded by the C<untie> function.]
es_es: [Esta función ha sido largamente supeditada por la función C<untie>].

source: Breaks the binding between a DBM file and a hash.
es_es: Rompe la ligadura entre un fichero DBM y un hash.

source: =item dbmopen HASH,DBNAME,MASK X<dbmopen> X<dbm> X<ndbm> X<sdbm> X<gdbm>
es_es: =item dbmopen HASH,NOMBREDB,MÁSCARA X<dbmopen> X<dbm> X<ndbm> X<sdbm> X<gdbm>

source: [This function has been largely superseded by the C<tie> function.]
es_es: [Esta función ha sido largamente supeditada por la función C<tie>].

source: This binds a dbm(3), ndbm(3), sdbm(3), gdbm(3), or Berkeley DB file to a hash.
es_es: Liga un fichero dbm(3), ndbm(3), sdbm(3), gdbm(3), o Berkeley DB a un hash.

source: HASH is the name of the hash.
es_es: HASH es el nombre del hash.

source: (Unlike normal C<open>, the first argument is I<not> a filehandle, even though it looks like one).
es_es: (A diferencia de un C<open> normal, el primer argumento I<no> es un manejador, aunque lo parezca).

source: DBNAME is the name of the database (without the F<.dir> or F<.pag> extension if any).
es_es: NOMBREDB es el nombre de la base de datos (sin la extensión F<.dir> o F<.pag> si las tuviera).

source: If the database does not exist, it is created with protection specified by MASK (as modified by the C<umask>).
es_es: Si la base de datos no existe, se crea con la protección especificada por MÁSCARA (y modificada por C<umask>).

source: If your system supports only the older DBM functions, you may perform only one C<dbmopen> in your program.
es_es: Si su sistema sólo soporta las viejas funciones DBM, sólo puede realizar un C<dbmopen> en su programa.

source: In older versions of Perl, if your system had neither DBM nor ndbm, calling C<dbmopen> produced a fatal error; it now falls back to sdbm(3).
es_es: En las viejas versiones de Perl, si el sistema no tenía ni DBM ni ndbm, llamando a C<dbmopen> producía un error fatal; ahora lo intentaría con sdbm(3).

source: If you don't have write access to the DBM file, you can only read hash variables, not set them.
es_es: Si no tiene permiso de escritura al fichero DBM, sólo podrá leer las variables hash, pero no asignarlas.

source: If you want to test whether you can write, either use file tests or try setting a dummy hash entry inside an C<eval>, which will trap the error.
es_es: Si quiere comprobar si puede escribir o no, use comprobaciones de fichero o intente asignar una entrada hash ficticia dentro de un C<eval>, que atrapará el error.

source: Note that functions such as C<keys> and C<values> may return huge lists when used on large DBM files.
es_es: Note que las funciones como C<keys> y C<values> pueden devolver largas listas cuando se usan con ficheros DBM grandes.

source: You may prefer to use the C<each> function to iterate over large DBM files.
es_es: Puede preferir usar la función C<each> para iterar sobre ficheros DBM grandes.

source: # print out history file offsets
es_es: # imprime los desplazamientos en el fichero histórico

# while (($key,$val) = each %HIST) { print $key, ' = ', unpack('L',$val), " ";
source: while (($key,$val) = each %HIST) { print $key, ' = ', unpack('L',$val), "\n";
es_es: while (($clave,$valor) = each %HIST) { print $clave, ' = ', unpack('L',$valor), "\n";

source: See also L<AnyDBM_File> for a more general description of the pros and cons of the various dbm approaches, as well as L<DB_File> for a particularly rich implementation.
es_es: Ver también L<AnyDBM_File> para una descripción más general de los pros y contras de las distintas formas dbm, así como L<DB_File> para ver una implementación particularmente rica.

source: You can control which DBM library you use by loading that library before you call dbmopen():
es_es: Puede controlar qué biblioteca DBM usará cargando la biblioteca antes de llamar a dbmopen():

source: dbmopen(%NS_Hist, "$ENV{HOME}/.netscape/history.db") or die "Can't open netscape history file: $!";
es_es: dbmopen(%NS_Hist, "$ENV{HOME}/.netscape/history.db") or die "No puedo abrir el archivo histórico del netscape: $!";

source: =item defined EXPR X<defined> X<undef> X<undefined>
es_es: =item defined EXPR X<defined> X<undef> X<undefined> X<definido> X<indefinido>

source: Returns a Boolean value telling whether EXPR has a value other than the undefined value C<undef>.
es_es: Devuelve un valor Booleano indicando si EXPR tiene un valor que no sea el valor indefinido C<undef>.

source: If EXPR is not present, C<$_> will be checked.
es_es: Si EXPR no está presnte, C<$_> será lo comprobado.

source: Many operations return C<undef> to indicate failure, end of file, system error, uninitialized variable, and other exceptional conditions.
es_es: Muchas operaciones devuelven C<undef> para indicar un fallo, fin de fichero, error del sistema, variable no inicializada u otras condiciones excepcionales.

source: This function allows you to distinguish C<undef> from other values.
es_es: Esta función le permite distinguir C<undef> de otros valores.

source: (A simple Boolean test will not distinguish among C<undef>, zero, the empty string, and C<"0">, which are all equally false.) Note that since C<undef> is a valid scalar, its presence doesn't I<necessarily> indicate an exceptional condition: C<pop> returns C<undef> when its argument is an empty array, I<or> when the element to return happens to be C<undef>.
es_es: (Un simple test Booleano no distinguirá entre C<undef>, cero, el string vacío y C<"0">, que son todos igualmente falso). Note que como C<undef> es un escalar válido, su presencia no indica I<necesariamente> una condición excepcional: C<pop> devuelve C<undef> cuando su argumento es un array vacío, I<o> cuando el elemento a devolver sea un C<undef>.

source: You may also use C<defined(&func)> to check whether subroutine C<&func> has ever been defined.
es_es: Puede usar también C<defined(&func)> para comprobar si la subrutina C<&func> ha sido definida.

source: The return value is unaffected by any forward declarations of C<&func>.
es_es: El valor devuelto no es afectado por ninguna declaración posterior de C<&func>.

source: Note that a subroutine which is not defined may still be callable: its package may have an C<AUTOLOAD> method that makes it spring into existence the first time that it is called -- see L<perlsub>.
es_es: Note que una subrutina que no ha sido definida puede ser ejecutada: su paquete puede tener un método C<AUTOLOAD> que la hace aparecer la primera vez que es llamada -- ver L<perlsub>.

source: Use of C<defined> on aggregates (hashes and arrays) is deprecated.
es_es: El uso de C<defined> sobre datos agregados (hashes y arrays) está desaconsejado.

source: It used to report whether memory for that aggregate has ever been allocated.
es_es: Se usó para informar si la memoria para los datos agregados había sido reservada.

source: This behavior may disappear in future versions of Perl.
es_es: Este comportamiento puede desaparecer en futuras versiones de Perl.

source: You should instead use a simple test for size:
es_es: Utilize en su lugar una comprobación de tamaño:

# if (@an_array) { print "has array elements " }
source: if (@an_array) { print "has array elements\n" }
es_es: if (@un_array) { print "tiene elementos array\n" }

# if (%a_hash) { print "has hash members " }
source: if (%a_hash) { print "has hash members\n" }
es_es: if (%un_hash) { print "tiene elementos hash\n" }

source: When used on a hash element, it tells you whether the value is defined, not whether the key exists in the hash.
es_es: Cuando se usa con un elemento de un hash, le indica si el valor está definido, no si la clave existe en el hash.

source: Use L</exists> for the latter purpose.
es_es: Use L</exists> para este propósito.

source: Examples:
es_es: Ejemplos:

# print "$val " while defined($val = pop(@ary));
source: print "$val\n" while defined($val = pop(@ary));
es_es: print "$valor\n" while defined($valor = pop(@array));

source: die "Can't readlink $sym: $!" unless defined($value = readlink $sym);
es_es: die "No puedo hacer un readlink $sym: $!" unless defined($valor = readlink $sym);

source: Note: Many folks tend to overuse C<defined>, and then are surprised to discover that the number C<0> and C<""> (the zero-length string) are, in fact, defined values.
es_es: Nota: mucha gente tiende a sobrevalorar C<defined> y, para su sorpresa, descubren que el número C<0> y C<""> (el string de longitud cero) son, de hecho, valores definidos.

source: For example, if you say
es_es: Por ejemplo, si dice

source: The pattern match succeeds, and C<$1> is defined, despite the fact that it matched "nothing".
es_es: El patrón de búsqueda tiene éxito, y C<$1> es definida, a pesar del hecho de que se ha correspondido con "nada".

source: It didn't really fail to match anything.
es_es: No ha fallado al corresponder con cualquier cosa.

source: Rather, it matched something that happened to be zero characters long.
es_es: Más bien, ha coincidido con algo que parece tener cero caracteres de longitud.

source: This is all very above-board and honest.
es_es: Todo esto trata sobre la honraded.

source: When a function returns an undefined value, it's an admission that it couldn't give you an honest answer.
es_es: Cuando una función devuelve un valor indefinido, se asume que no puede dar una respuesta honrada.

source: So you should use C<defined> only when you're questioning the integrity of what you're trying to do.
es_es: Así que puede usar C<defined> sólo cuando está cuestionando la integridad de lo que está intentando hacer.

source: At other times, a simple comparison to C<0> or C<""> is what you want.
es_es: En otras ocasiones, una simple comparación con C<0> o C<""> es lo que necesita.

source: See also L</undef>, L</exists>, L</ref>.
es_es: Ver también L</undef>, L</exists>, L</ref>.

source: Given an expression that specifies a hash element, array element, hash slice, or array slice, deletes the specified element(s) from the hash or array.
es_es: Dad una expresión que especifica un elemento de un hash, un elemento de un array, una porción de hash o una porción de un array, borra los elementos especificados del hash o array.

source: In the case of an array, if the array elements happen to be at the end, the size of the array will shrink to the highest element that tests true for exists() (or 0 if no such element exists).
es_es: En caso de un array, si los elementos del array se encuentran al final, el tamaño del array se reducirá al mayor elemento que dé verdadero en la comprobación de exists() (o 0 si no existe tal elemento).

source: Returns a list with the same number of elements as the number of elements for which deletion was attempted.
es_es: Devuelve una lista con el mismo número de elementos que el número de elementos por los cuales se intentó su borrado.

source: Each element of that list consists of either the value of the element deleted, or the undefined value.
es_es: Cada elemento de la lista consiste del valor del elemento borrado o un valor indefinido.

source: In scalar context, this means that you get the value of the last element deleted (or the undefined value if that element did not exist).
es_es: En contexto escalar, esto significa que obtiene el valor del último elemento borrado (o el valor indefinido si este elemento no existía).

source: $scalar = delete $hash{foo}; # $scalar is 11
es_es: $escalar = delete $hash{foo}; # $escalar es 11

source: $scalar = delete @hash{qw(foo bar)}; # $scalar is 22
es_es: $escalar = delete @hash{qw(foo bar)}; # $escalar es 22

source: @array = delete @hash{qw(foo bar baz)}; # @array is (undef,undef,33)
es_es: @array = delete @hash{qw(foo bar baz)}; # @array es (undef,undef,33)

source: Deleting from C<%ENV> modifies the environment.
es_es: Borrando de C<%ENV> modifica el entorno.

source: Deleting from a hash tied to a DBM file deletes the entry from the DBM file.
es_es: Borrando de un hash enlazado a un fichero DBM borra esa entrada del fichero DBM.

source: Deleting from a C<tie>d hash or array may not necessarily return anything.
es_es: Borrando de un hash o array C<enlazado> no necesariamente devolverá algo.

source: Deleting an array element effectively returns that position of the array to its initial, uninitialized state.
es_es: Borrando un elemento de un array devolverá efectivamente esa posición del array a su inicial y no inicializado estado.

source: Subsequently testing for the same element with exists() will return false.
es_es: Subsiguiente comprobación del mismo elemento con exists() devolverá falso.

source: Also, deleting array elements in the middle of an array will not shift the index of the elements after them down.
es_es: También, borrando elementos de un array en mitad del array no desplazará el índice de los elementos que estén por debajo de ellos.

source: Use splice() for that.
es_es: Use splice() para esto.

source: See L</exists>.
es_es: Ver L</exists>.

source: The following (inefficiently) deletes all the values of %HASH and @ARRAY:
es_es: Lo siguiente borra (ineficientemente) todos los valores de %HASH y @ARRAY:

source: foreach $key (keys %HASH) { delete $HASH{$key};
es_es: foreach $clave (keys %HASH) { delete $HASH{$clave};

source: foreach $index (0 ..
es_es: foreach $indice (0 ..

source: $#ARRAY) { delete $ARRAY[$index];
es_es: $#ARRAY) { delete $ARRAY[$indice];

source: And so do these:
es_es: Así como estos:

source: But both of these are slower than just assigning the empty list or undefining %HASH or @ARRAY:
es_es: Pero esto es más lento que simplemente asignar una lista vacía o indefiniendo %HASH o @ARRAY:

source: %HASH = (); # completely empty %HASH
es_es: %HASH = (); # vacía completamente %HASH

source: undef %HASH; # forget %HASH ever existed
es_es: undef %HASH; # hace que %HASH nunca haya existido

source: @ARRAY = (); # completely empty @ARRAY
es_es: @ARRAY = (); # vacía completamente @ARRAY

source: undef @ARRAY; # forget @ARRAY ever existed
es_es: undef @ARRAY; # hace que @ARRAY nunca haya existido

source: Note that the EXPR can be arbitrarily complicated as long as the final operation is a hash element, array element, hash slice, or array slice lookup:
es_es: Note que EXPR puede ser tan arbitrariamente complicada con tal de que el final de la operación sea un elemento de un hash, de un array o una porción de un hash o array:

source: delete $ref->[$x][$y]{$key};
es_es: delete $ref->[$x][$y]{$clave};

source: delete @{$ref->[$x][$y]}{$key1, $key2, @morekeys};
es_es: delete @{$ref->[$x][$y]}{$clave1, $clave2, @masclaves};

source: delete $ref->[$x][$y][$index];
es_es: delete $ref->[$x][$y][$indice];

source: delete @{$ref->[$x][$y]}[$index1, $index2, @moreindices];
es_es: delete @{$ref->[$x][$y]}[$indice1, $indice2, @masindices];

source: =item die LIST X<die> X<throw> X<exception> X<raise> X<$@> X<abort>
es_es: =item die LISTA X<die> X<throw> X<excepción> X<raise> X<$@> X<abort>

source: Outside an C<eval>, prints the value of LIST to C<STDERR> and exits with the current value of C<$!> (errno).
es_es: Fuera de un C<eval>, imprime el valor de LIST al C<STDERR> y sale con el valor actual de C<$!> (errno).

source: If C<$!> is C<0>, exits with the value of C<<< ($?
es_es: Si C<$!> es C<0>, sale con el valor de C<<< ($?

source: >> 8) >>> (backtick `command` status).
es_es: >> 8) >>> (estatus de la `orden`).

source: If C<<< ($?
es_es: Si C<<< ($?

source: >> 8) >>> is C<0>, exits with C<255>.
es_es: >> 8) >>> es C<0>, sale con C<255>.

source: Inside an C<eval(),> the error message is stuffed into C<$@> and the C<eval> is terminated with the undefined value.
es_es: Dentro de un C<eval()>, el mensaje de error es colocado en C<$@> y el C<eval> termina con el valor indefinido.

source: This makes C<die> the way to raise an exception.
es_es: Esta es la forma para que C<die> cree una excepcion.

source: Equivalent examples:
es_es: Ejemplos equivalentes:
